"""
지금까지 배운것 정리
내장자료형 : int, string, boolean
변수 : a = 10
주석 : # 과 ''' 이 있다.
연산자 : 산술, 비교, 논리, 할당, 그외
"""

quiz1 = """
퀴즈1 : 지금까지 영어로만 변수명을 만들었지만, 파이썬은 한글 변수명도 지원을 합니다. 
ㅁㅁㅁ ㅇㅇㅇ 라는 두개의 변수로 아래와 같은 문장을 만들어보세요.

- 파이썬 재밌어
- 나는 멋있어
- 나는 프로그래머다

아래의 구문을 사용하면 됩니다.
print(f"- {ㅁㅁㅁ} {ㅇㅇㅇ}")
"""

quiz2 = """ 
N명이 밥을 먹고 X원이 나왔습니다. 
한 명당 내야하는 금액(to_pay)을 계산해봅시다.
나머지는 버립니다. 

N = 3
X = 30000
to_pay ? 
"""


# quiz3 아래의 favorites 를 완성해 봅시다.
favorites = f"""
좋아하는 음악 : {music} 

좋아하는 영화 : {movie}  

좋아하는 책 : {book}  

좋아하는 {some} : {thing}  
"""
